#------------------------------
# 基本設定
#------------------------------
[ -f ~/.zshrc.base ] && source ~/.zshrc.base

#------------------------------
# 履歴設定
#------------------------------
[ -f ~/.zshrc.history ] && source ~/.zshrc.history

#------------------------------
# 色設定
#------------------------------
[ -f ~/.zshrc.color ] && source ~/.zshrc.color

#------------------------------
# プロンプト
#------------------------------
[ -f ~/.zshrc.prompt ] && source ~/.zshrc.prompt

#------------------------------
# エイリアス設定読み込み
#------------------------------
[ -f ~/.zshrc.alias ] && source ~/.zshrc.alias

#------------------------------
# screen関連設定読み込み
#------------------------------
[ -f ~/.zshrc.screen ] && source ~/.zshrc.screen

#------------------------------
# zshをvimモードで
#------------------------------
[ -f ~/.zshrc.vi ] && source ~/.zshrc.vi

#------------------------------
# ローカル設定読み込み
#------------------------------
[ -f ~/.zshrc.local ] && source ~/.zshrc.local
