#------------------------------
# 基本設定
#------------------------------
[ -f ~/.zshrc.base ] && source ~/.zshrc.base

#------------------------------
# 色設定
#------------------------------
[ -f ~/.zshrc.color ] && source ~/.zshrc.color

#------------------------------
# プロンプト
#------------------------------
[ -f ~/.zshrc.prompt ] && source ~/.zshrc.prompt

#------------------------------
# エイリアス設定読み込み
#------------------------------
[ -f ~/.zshrc.alias ] && source ~/.zshrc.alias

#------------------------------
# screen関連設定読み込み
#------------------------------
[ -f ~/.zshrc.screen ] && source ~/.zshrc.screen

#------------------------------
# zshをvimモードで
#------------------------------
[ -f ~/.zshrc.vi ] && source ~/.zshrc.vi

#------------------------------
# 履歴設定
#------------------------------
[ -f ~/.zshrc.history ] && source ~/.zshrc.history

#------------------------------
# ローカル設定読み込み
#------------------------------
[ -f ~/.zshrc.local ] && source ~/.zshrc.local

#------------------------------
# 文字コード別の設定読み込み
#------------------------------
case $LANG in
    ja_JP.UTF-8)
        #------------------------------
        # UTF-8用の設定読み込み
        #------------------------------
        [ -f ~/.zshrc.utf8 ] && source ~/.zshrc.utf8
    ;;
    *)
        #------------------------------
        # EUC-JP用の設定読み込み
        #------------------------------
        [ -f ~/.zshrc.eucjp ] && source ~/.zshrc.eucjp
    ;;
esac
