oh-my-fish/plugin-argu
oh-my-fish/plugin-bak
oh-my-fish/plugin-balias
edc/bass
oh-my-fish/plugin-bundler
oh-my-fish/plugin-cask
oh-my-fish/theme-cmorrell.com
oh-my-fish/plugin-composer
oh-my-fish/plugin-config
brgmnn/fish-docker-compose
oh-my-fish/plugin-expand
oh-my-fish/plugin-foreign-env
oh-my-fish/plugin-gem
riichard/fish-git-branch
oh-my-fish/plugin-gityaw
oh-my-fish/plugin-grc
oh-my-fish/marlin
oh-my-fish/plugin-osx
oh-my-fish/plugin-peco
# https://gist.github.com/kceejp/6fdb4365ec5f6e97c14881c32a99a3c2
yoshiori/fish-peco_select_ghq_repository
# https://gist.github.com/patorash/377268ef75f012318279
oh-my-fish/plugin-python
oh-my-fish/plugin-rails
oh-my-fish/plugin-ssh
tuvistavie/fish-ssh-agent
oh-my-fish/plugin-ssh-config.d
wk/plugin-ssh-term-helper
oh-my-fish/plugin-thefuck
oh-my-fish/plugin-theme
oh-my-fish/plugin-vi-mode
